docs/leets/0401-Binary-Watch.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-07-10 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="d)zharii" />
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<link rel="stylesheet" href="/static/t.css"/>
</head>
<body>
<nav><a href="/" tabindex="0">&larrhk; Back to Index</a></nav><div id="preamble" class="status">
Published 
</div>
<div id="content" class="content">
<div id="outline-container-org3486961" class="outline-2">
<h2 id="org3486961">401. Binary Watch</h2>
<div class="outline-text-2" id="text-org3486961">
</div>

<div id="outline-container-orgf053a9a" class="outline-3">
<h3 id="orgf053a9a">Problem:</h3>
<div class="outline-text-3" id="text-orgf053a9a">
<p>
A binary watch has 4 LEDs on the top that represent the hours (0-11), and the 6 LEDs on the bottom represent the minutes (0-59). Each LED represents a zero or one, with the least significant bit on the right.
</p>

<p>
Given a non-negative integer n which represents the number of LEDs that are currently on, return all possible times the watch could represent.
</p>
</div>
</div>

<div id="outline-container-org5395ab2" class="outline-3">
<h3 id="org5395ab2">Solution Description:</h3>
<div class="outline-text-3" id="text-org5395ab2">
<p>
To implement the solution, we need to generate all possible combinations of hour and minute counts where the total number of bits is equal to n. This can be achieved by iterating through all possible hours (0-11) and minutes (0-59) and counting their respective bits. If the sum of the bits equals n, we format the time as a string and store it.
</p>
</div>
</div>
</div>

<div id="outline-container-org4391081" class="outline-2">
<h2 id="org4391081">Time Complexity: O(1), because there are a fixed number of hours (12) and minutes (60), resulting in a constant time complexity regardless of input size.</h2>
</div>
<div id="outline-container-orgdfb0217" class="outline-2">
<h2 id="orgdfb0217">Space Complexity: O(1) for the variables and result storage, which does not grow with input size.</h2>
<div class="outline-text-2" id="text-orgdfb0217">
</div>
<div id="outline-container-org129bcc9" class="outline-3">
<h3 id="org129bcc9">Example:</h3>
<div class="outline-text-3" id="text-org129bcc9">
<p>
For example, if n = 1, should return ['0:01', '0:02', '0:04', '0:08', '0:16', '0:32', '1:00', '2:00', '4:00', '8:00'] because each of these times has exactly one LED on.
</p>

<p>
Here's how the algorithm will work step-by-step:
</p>
<ol class="org-ol">
<li>Iterate through each hour (0 to 11).</li>
<li>Iterate through each minute (0 to 59).</li>
<li>Count the number of bits in the binary representation of the hour and minute.</li>
<li>If the count of bits matches n, format the time and add it to the result list.</li>
<li>Return the result list.</li>
</ol>
</div>
</div>

<div id="outline-container-orgfcfe0f8" class="outline-3">
<h3 id="orgfcfe0f8">Setup:</h3>
<div class="outline-text-3" id="text-orgfcfe0f8">
<p>
Here's the general framework for the solution implementation:
</p>

<div class="org-src-container">
<pre class="src src-js">
/**
 * Calculates the binary watch times with exactly n LEDs turned on
 * @param {number} num - number of LEDs that are currently on
 * @returns {string[]} - Array of possible times in 'h:mm' format
 */
function readBinaryWatch(num) {
    const log = typeof NestedInteger !== 'undefined' ? () =&gt; {} : console.log;
    const table = typeof NestedInteger!== 'undefined' ? () =&gt; {} : console.table;

    if (num &gt; 10) {
        return [];
    }

    function countSetBits(n, range) {
        let cnt = 0;
        for (let s = 0; s &lt; range; s++) {
            cnt += (n &gt;&gt; s) &amp; 1;
        }
        return cnt;
    }

    function fmt(hour, minute) {
        return `${hour}:${minute &gt; 9 ? minute : '0' + minute}`;
    }

    // log(countSetBits(1, 6));
    // log(countSetBits(6, 6));

    const result = [];
    for (let hour = 0; hour &lt; 12; hour++) {
        const hourBits = countSetBits(hour, 4);

        if (hourBits === num) {
            result.push(fmt(hour, 0))
        } else if (hourBits &lt; num) {
            for (let minute = 0; minute &lt; 60; minute++) {
                const minBits = countSetBits(minute, 6);
                if (hourBits + minBits === num) {
                    result.push(fmt(hour, minute));
                }
            }
        }
    }

    return result;
}

// Test cases
const testCases = [
    { num: 1, expected: ["0:01","0:02","0:04","0:08","0:16","0:32","1:00","2:00","4:00","8:00"] },
    { num: 0, expected: ["0:00"] },
    { num: 11, expected: [] }, // Impossible case since max LEDs possible is 10 (4 hours LEDs + 6 minutes LEDs)
];

testCases.forEach((test, index) =&gt; {
    const result = readBinaryWatch(test.num);
    const passed = JSON.stringify(result.sort()) === JSON.stringify(test.expected.sort());
    console.log(`Test Case ${index + 1}: ${passed ? 'Passed' : 'Failed'} (Expected: ${JSON.stringify(test.expected.sort())}, Got: ${JSON.stringify(result.sort())})`);
});
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
&copy; d)zharii. <a href="/sitemap.html">sitemap</a>
</div>
</body>
</html>
